app/controllers/changes_controller.rb

  def create
    @change = Change.new(params[:change])
    @change.task_id = params[:task_id]
    @change.user_id = current_user.id
    @task = Task.find(params[:task_id])

    @change.task_changes = get_task_changes(@task.attributes, params[:change][:task_attributes])

    if @change.save && @task.update_attributes(params[:change][:task_attributes])
      wachers_emails = @task.watchers(:conditions => ["id != ?", current_user.id]).collect(&:email)
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 0)
INSERT INTO `changes` (`days`, `updated_at`, `minutes`, `task_id`, `hours`, `user_id`, `comment`, `created_at`) VALUES(1, '2009-09-17 12:24:35', 3, 2, 2, NULL, 'asdfadsf', '2009-09-17 12:24:35')
UPDATE `tasks` SET `kind` = 'Bug', `resolution` = 'In progress', `status` = 'Closed', `updated_at` = '2009-09-22 12:48:40' WHERE `id` = 4
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1