app/controllers/milestones_controller.rb

  def index
    @milestones = current_project.milestones.all :order => "start_date"
---
SELECT * FROM `milestones` WHERE (`milestones`.project_id = 1) ORDER BY start_date

  def xml_month
    @milestones = Hash.new
    current_project.milestones.all(:order => "start_date").each do |milestone|
---
SELECT * FROM `milestones` WHERE (`milestones`.project_id = 1) ORDER BY start_date

  def get_milestones
    @current_project = Project.find_by_id(params[:project_id])
    current_user.update_attributes(:current_project_id => @current_project.id)
---
SELECT * FROM `projects` WHERE (`projects`.`id` = '2') LIMIT 1
UPDATE `users` SET `current_project_id` = 3, `updated_at` = '2009-09-24 11:22:05' WHERE `id` = 1

  def show
    @milestone = current_project.milestones.find(params[:id])
---
SELECT * FROM `milestones` WHERE (`milestones`.`id` = 1)

  def edit
    @milestone = current_project.milestones.find(params[:id])
---
SELECT * FROM `milestones` WHERE (`milestones`.`id` = 1)

  def create
    @milestone = current_project.milestones.new(params[:milestone])
    if @milestone.save
---
INSERT INTO `milestones` (`start_date`, `end_date`, `project_id`, `updated_at`, `title`, `description`, `created_at`) VALUES('2009-09-23', '2009-09-28', NULL, '2009-09-23 11:47:30', 'First milestone', 'Some big text here for first milestone. ', '2009-09-23 11:47:30')

  def update
    @milestone = current_project.milestones.find(params[:id])
    if @milestone.update_attributes(params[:milestone])
---
SELECT * FROM `milestones` WHERE (`milestones`.`id` = 1)
UPDATE `milestones` SET `updated_at` = '2009-09-23 12:15:50', `project_id` = 1 WHERE `id` = 1