app/controllers/milestones_controller.rb

  def get_milestones
    @month = params[:month].nil? ? Time.now.month : params[:month].to_i
    @year  = params[:year].nil? ? Time.now.year : params[:year].to_i

    @shown_month = Date.civil(@year, @month)
    @event_strips = Milestone.event_strips_for_month(@shown_month)

    if params[:project_id] == "-1"
      current_user.update_attributes(:current_project_id => -1)
      @milestones = current_user.projects.collect(&:milestones)
---
SELECT * FROM `milestones` WHERE (`milestones`.project_id = 2)