app/controllers/projects_controller.rb

SELECT * FROM `users`
---
  def new
    @project = Project.new
    @users = User.all

SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
SELECT * FROM `users`
---
  def edit
    @project = Project.find(params[:id])
    @users = User.all

INSERT INTO `projects` (`name`, `updated_at`, `description`, `created_at`) VALUES('Everything Ibiza', '2009-09-16 14:15:50', 'Everything ibiza', '2009-09-16 14:15:50')
---
  def create
    @project = Project.new(params[:project])
    if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
---
  def update
    @project = Project.find(params[:id])