app/controllers/projects_controller.rb

  def show
    @project = Project.all_project_user_works_for(current_user.id).find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1