app/controllers/r_files_controller.rb

SELECT * FROM `r_files`
---
  def index
    @r_files = current_project.files.all

SELECT * FROM `r_files` WHERE (`r_files`.`id` = 1)
---
  def show
    @r_file = RFile.find(params[:id])

INSERT INTO `r_files` (`updated_at`, `file_content_type`, `file_file_name`, `type`, `file_file_size`, `description`, `parent_id`, `created_at`) VALUES('2009-09-24 09:57:09', 'image/jpeg', 'Image_122_.jpg', NULL, 339215, 'Test', NULL, '2009-09-24 09:57:09')
---
  def create
    @r_file = RFile.new(params[:r_file])
    if @r_file.save