app/controllers/statistics_controller.rb

  def index
    @projects = current_user.projects
    @select_index = 0
    @projects.each_with_index do |p, i|
      @select_index = i if current_project.id == p.id
    end
    @start_date = params[:from] || Date.today.strftime("%Y-%m-%d")
    @end_date = params[:until] || Date.today.strftime("%Y-%m-%d")
    if current_user.is_superadmin
      @users = User.all
      @projects = Project.all
---
SELECT * FROM `users`
SELECT `projects`.* FROM `projects` INNER JOIN `memberships` ON `projects`.id = `memberships`.project_id WHERE ((`memberships`.user_id = 1))

  def users
    if current_user.is_superadmin
      @users = User.all
---
SELECT * FROM `users`

  def projects
    if current_user.is_superadmin
      @projects = Project.all
---
SELECT * FROM `projects` LIMIT 1

  def project_detail
    if current_user.is_superadmin
      @projects = Project.all
      @project = Project.find(params[:project_id])
---
SELECT * FROM `projects` LIMIT 1
SELECT * FROM `projects` WHERE (`projects`.`id` = 2)

  def user_detail
    if current_user.is_superadmin
      @users = User.all
      @user = User.find(params[:user_id])
---
SELECT * FROM `users`
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1