app/controllers/statistics_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def xml_user_this_week
    @user = User.find(params[:user_id])