app/controllers/tasks_controller.rb

SELECT `users`.* FROM `users` INNER JOIN `memberships` ON `users`.id = `memberships`.user_id WHERE ((`memberships`.project_id = 1))
---
  def add_watcher
    @task = Task.find(params[:id])
    @watcher = User.find(params[:watcher_id])
    unless @task.watchers(:select => :id).collect(&:id).include?(@watcher.id)

SELECT * FROM `projects` LIMIT 1
---
  def create
    @task = Task.new(params[:task])
    if @task.save
      send_email('create_a_new_task', @task.asignee, "New task created: #{@task.project.name} : #{@task.title}", @task)
      flash[:notice] = "Task was successfully created. Email sent to #{@task.asignee.name}."
      redirect_to(@task)
    else
      #render :action => "new"
      render :update do |page|
        page << "alert('why?'); #{@task.errors.each {|e| e}}"