app/controllers/tasks_controller.rb

  def index
    @user_of_tasks = params[:user_id] ? params[:user_id] : current_user.id
    @tasks = current_project.tasks.assignee_id_equals(@user_of_tasks).kind_equals(session[:tasks_kind]).priority_equals(session[:tasks_priority]).status_equals(session[:tasks_status]).resolution_equals(session[:tasks_resolution]).paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM `tasks` WHERE ((tasks.resolution IN ('In progress','Completed','Won\'t fix','Needs reivew')) AND ((tasks.status IN ('Active','Closed')) AND ((tasks.priority IN ('5','4','3','2','1')) AND ((tasks.kind IN ('Bug','Feature','Story')) AND ((tasks.assignee_id = 1) AND (`tasks`.project_id = 1)))))) LIMIT 0, 10
SELECT count(*) AS count_all FROM `tasks` WHERE ((tasks.resolution IN ('In progress','Completed','Won\'t fix','Needs reivew')) AND ((tasks.status IN ('Active','Closed')) AND ((tasks.priority IN ('5','4','3','2','1')) AND ((tasks.kind IN ('Bug','Feature','Story')) AND ((tasks.assignee_id = 1) AND (`tasks`.project_id = 1))))))

  def get_tasks
    @current_project = Project.find_by_id(params[:project_id])
    current_user.update_attributes(:current_project_id => @current_project.id)
    @tasks = @current_project.tasks.find_all_by_assignee_id(current_user.id).paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 'undefined') LIMIT 1
UPDATE `users` SET `current_project_id` = 1, `updated_at` = '2009-09-17 13:48:32' WHERE `id` = 1
SELECT * FROM `tasks` WHERE (`tasks`.`assignee_id` = 1) AND (`tasks`.project_id = 1)

  def add_watcher
    @task = Task.find(params[:id])
    @watcher = User.find(params[:watcher_id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 7)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 3 AND (`tasks`.project_id = 1))

  def new
    @task = Task.new
    @users = current_project.users
    @users_select = @users.collect{ |u| [u.name, u.id] }
---
SELECT `users`.* FROM `users` INNER JOIN `memberships` ON `users`.id = `memberships`.user_id WHERE ((`memberships`.project_id = 1))

  def create
    @task = Task.new(params[:task])
    if @task.save
---
INSERT INTO `tasks` (`status`, `assignee_id`, `resolution`, `updated_at`, `project_id`, `title`, `kind`, `priority`, `estimated_time`, `description`, `opener_id`, `created_at`) VALUES('Active', NULL, NULL, '2009-09-16 14:57:15', 1, 'test', NULL, 0, '2323', 'test', NULL, '2009-09-16 14:57:15')