app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save do |result|
---
INSERT INTO `users` (`name`, `updated_at`, `crypted_password`, `username`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('cristi', '2009-09-16 11:10:52', '3f0d949e412406fde7baed0fcd016feb0b5342f15bca89f83fcbbc8da1c51aa3feb4207e6f51ef0669eafe2930361f5117a1e1ece237acd2799717948fa6fa39', 'cristi', 'BlRDqu-eNw3TmOLWI6cs', '13cff6f6173de7620f206f15ae7c6d8ca4bbff2ca3c410ce8ffdefabcdb7411b609669180230d7b29e3ee07b65f73e06a7061ed0c83f3130d97228d531bddf80', 'cristi@yaho.com', '2009-09-16 11:10:52')